ams/src/DataProcessors/AMS_ДоступностьТоваров/AMS_ДоступностьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_ДоступностьТоваров</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьОтрицательныеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьОстаткиЦех3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цех</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВНаличии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доступно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыКлиента</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ams/src/DataProcessors/AMS_ДоступностьТоваров/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаМеткиПриИзменении(Элемент)
	Для каждого Стр Из Объект.ЗаказыКлиента Цикл
		Стр.Метка = Стр.ДатаОтгрузки <= КонецДня(ДатаМетки);
	КонецЦикла;
	
	Если Не Элементы.ЗаказыКлиента.ТекущиеДанные = Неопределено Тогда
		ЗаполнитьТаблицуТовары();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтрицательныеОстаткиПриИзменении(Элемент)
	Элементы.ПоказатьОстаткиЦех3.Доступность = Объект.ПоказатьОтрицательныеОстатки;
	
	ЗаполнитьТаблицуТовары();
	ПоказатьКоличествоУпаковокНоменклатурыВЗаказах();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОстаткиЦех3ПриИзменении(Элемент)
	ЗаполнитьТаблицуТовары();
	ПоказатьКоличествоУпаковокНоменклатурыВЗаказах();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаказыКлиента

&НаКлиенте
Процедура ЗаказыКлиентаПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ЗаказыПриАктивизацииСтрокиОбработчикОжидания",0.1,Истина)
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКлиентаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элемент.ТекущиеДанные.ЗаказКлиента);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКлиентаМеткаПриИзменении(Элемент)
	ЗаполнитьТаблицуТовары();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ТоварыПриАктивизацииСтрокиОбработчикОжидания",0.1,Истина)
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДанные();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанные()
	ЗаполнитьТаблицуЗаказыКлиента();
	ЗаполнитьТаблицуТовары();
	ПоказатьКоличествоУпаковокНоменклатурыВЗаказах();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗаказыКлиента()
	Коннектор = РеквизитФормыВЗначение("Объект");
	Коннектор.ЗаполнитьТаблицуЗаказыКлиента();
	ЗначениеВДанныеФормы(Коннектор, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПриАктивизацииСтрокиОбработчикОжидания()
	Стр = Элементы.ЗаказыКлиента.ТекущиеДанные;
	
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказКлиента = Стр.ЗаказКлиента;
	
	Если Объект.ЗаказКлиента <> ЗаказКлиента Тогда
		Объект.ЗаказКлиента = ЗаказКлиента;
		ЗаполнитьТаблицуТовары();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТовары()
	Коннектор = РеквизитФормыВЗначение("Объект");
	Коннектор.ЗаполнитьТаблицуТовары();
	ЗначениеВДанныеФормы(Коннектор, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтрокиОбработчикОжидания()
	Стр = Элементы.Товары.ТекущиеДанные;
	
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = Стр.Номенклатура;
	
	Если Объект.Номенклатура <> Номенклатура Тогда
		Объект.Номенклатура = Номенклатура;
		ПоказатьКоличествоУпаковокНоменклатурыВЗаказах();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьКоличествоУпаковокНоменклатурыВЗаказах()
	Коннектор = РеквизитФормыВЗначение("Объект");
	Коннектор.ПоказатьКоличествоУпаковокНоменклатурыВЗаказах();
	ЗначениеВДанныеФормы(Коннектор, Объект);
	
	Элементы.ЗаказыКлиентаКоличествоУпаковок.Заголовок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "Артикул");
КонецПроцедуры

#КонецОбласти
